while True:
    user_input = int(input("Введите число от 1 до 12 >>> "))
    season_dict = {1: "зимний",
                   2: "зимний",
                   3: "весенний",
                   4: "весенний",
                   5: "весенний",
                   6: "летний",
                   7: "летний",
                   8: "летний",
                   9: "осенний",
                   10: "осенний",
                   11: "осенний",
                   12: "зимний"
                   }

    summary = season_dict.get(user_input)
    print("Это", summary, "месяц")

